<a href="https://colab.research.google.com/github/dan-candeira/Nuforc-Project/blob/master/5.4-Exploracao/5.4-nuforc.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
#! pip install pandasql
import pandasql as ps
import requests
from bs4 import BeautifulSoup

In [9]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/dan-candeira/Nuforc-Project/master/5.2-Coleta/ufoCollection.csv'
    ).drop(columns=['Unnamed: 0'])

         Date / Time  ...    Posted
0      9/30/97 22:00  ...    3/2/04
1      9/30/97 20:00  ...  10/30/06
2      9/28/97 23:15  ...    7/5/99
3      9/27/97 23:00  ...   2/22/05
4      9/27/97 05:00  ...    8/5/01
...              ...  ...       ...
99700   8/1/17 14:00  ...   7/25/19
99701   8/1/17 06:15  ...    8/4/17
99702   8/1/17 02:45  ...    8/4/17
99703   8/1/17 02:00  ...    8/4/17
99704   8/1/17 01:00  ...    5/9/19

[99705 rows x 7 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99705 entries, 0 to 99704
Data columns (total 7 columns):
Date / Time    99705 non-null object
City           99511 non-null object
State          92524 non-null object
Shape          97703 non-null object
Duration       96725 non-null object
Summary        99684 non-null object
Posted         99703 non-null object
dtypes: object(7)
memory usage: 5.3+ MB

In [5]:
df.isna().sum()

Date / Time       0
City            194
State          7181
Shape          2002
Duration       2980
Summary          21
Posted            2
dtype: int64

In [6]:
df.shape

(99705, 7)

#### Reports descending order by State

In [12]:
query = '''
  SELECT State, COUNT(Posted) as Reports 
  FROM df
  GROUP BY State 
  ORDER BY Reports DESC 
'''

per_state = ps.sqldf(query, locals())

   State  Reports
0     CA    11402
1   None     7181
2     FL     5577
3     WA     4901
4     TX     4154
..   ...      ...
64    PE       20
65    YT       19
66    PR       18
67    YK        5
68    VI        1

[69 rows x 2 columns]

#### Reports descending order by State without blank states

In [16]:
query = '''
  SELECT State, COUNT(Posted) as Reports FROM df
  WHERE State != ''
  GROUP BY State 
  ORDER BY Reports DESC 
'''

per_state_no_blanck = ps.sqldf(query, locals())

   State  Reports
0     CA    11402
1     FL     5577
2     WA     4901
3     TX     4154
4     NY     3871
..   ...      ...
63    PE       20
64    YT       19
65    PR       18
66    YK        5
67    VI        1

[68 rows x 2 columns]

#### Getting the list of USA - States

In [17]:
request = requests.get('https://simple.wikipedia.org/wiki/List_of_U.S._states').text
soup = BeautifulSoup(request, 'html.parser')
table = soup.find_all('table', class_='wikitable')
data = pd.read_html(str(table))[0]
data.head()

         Name postal abbreviation[1]  ... Water area[4] Numberof Reps.
         Name postal abbreviation[1]  ...           km2 Numberof Reps.
0     Alabama                     AL  ...          4597              7
1      Alaska                     AK  ...        245384              1
2     Arizona                     AZ  ...          1026              9
3    Arkansas                     AR  ...          2961              4
4  California                     CA  ...         20501             53

[5 rows x 13 columns]

#### Getting abreviations from the data collected

In [20]:
states = data.loc[:, ['postal abbreviation[1]', 'Name']]
states.columns = ['State_Name', 'State_Abbr']

                      State_Name State_Abbr
0                        Alabama         AL
1                         Alaska         AK
2                        Arizona         AZ
3                       Arkansas         AR
4                     California         CA
5                       Colorado         CO
6                    Connecticut         CT
7                       Delaware         DE
8                        Florida         FL
9                        Georgia         GA
10                        Hawaii         HI
11                         Idaho         ID
12                      Illinois         IL
13                       Indiana         IN
14                          Iowa         IA
15                        Kansas         KS
16       Kentucky[upper-alpha 3]         KY
17                     Louisiana         LA
18                         Maine         ME
19                      Maryland         MD
20  Massachusetts[upper-alpha 3]         MA
21                      Michigan         MI
22                     Minnesota         MN
23                   Mississippi         MS
24                      Missouri         MO
25                       Montana         MT
26                      Nebraska         NE
27                        Nevada         NV
28                 New Hampshire         NH
29                    New Jersey         NJ
30                    New Mexico         NM
31                      New York         NY
32                North Carolina         NC
33                  North Dakota         ND
34                          Ohio         OH
35                      Oklahoma         OK
36                        Oregon         OR
37   Pennsylvania[upper-alpha 3]         PA
38   Rhode Island[upper-alpha 4]         RI
39                South Carolina         SC
40                  South Dakota         SD
41                     Tennessee         TN
42                         Texas         TX
43                          Utah         UT
44                       Vermont         VT
45       Virginia[upper-alpha 3]         VA
46                    Washington         WA
47                 West Virginia         WV
48                     Wisconsin         WI
49                       Wyoming         WY

In [19]:
query = '''
  SELECT df.State, COUNT(df.Posted) as Reports FROM df, states
  WHERE State = State_Abbr
  GROUP BY State
'''
eua_posts = ps.sqldf(query, locals())
eua_posts.head()

  State  Reports
0    AK      449
1    AL      893
2    AR      761
3    AZ     3464
4    CA    11402

In [21]:
eua_posts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 2 columns):
State      50 non-null object
Reports    50 non-null int64
dtypes: int64(1), object(1)
memory usage: 928.0+ bytes

In [22]:
eua_posts.describe()

            Reports
count     50.000000
mean    1762.800000
std     1865.875764
min      154.000000
25%      752.750000
50%     1166.000000
75%     2049.750000
max    11402.000000

In [24]:
query = '''
  SELECT df.* FROM df, states
  WHERE State = State_Abbr
'''
eua_df = ps.sqldf(query, locals())

         Date / Time  ...   Posted
0      9/30/97 22:00  ...   3/2/04
1      9/28/97 23:15  ...   7/5/99
2      9/27/97 23:00  ...  2/22/05
3      9/27/97 05:00  ...   8/5/01
4      9/25/97 22:00  ...  1/28/99
...              ...  ...      ...
88137   8/1/17 14:00  ...  7/25/19
88138   8/1/17 06:15  ...   8/4/17
88139   8/1/17 02:45  ...   8/4/17
88140   8/1/17 02:00  ...   8/4/17
88141   8/1/17 01:00  ...   5/9/19

[88142 rows x 7 columns]

In [26]:
query = '''  
  SELECT *, COUNT(Posted) as Reports FROM eua_df
  GROUP BY City
  ORDER BY Reports
'''

reports_by_city = ps.sqldf(query, locals())

          Date / Time                                  City  ...    Posted Reports
0       1/20/10 19:30                            ((HOAX??))  ...   2/14/10       1
1       5/10/17 21:00   ((Location no revealed by witness))  ...   5/11/17       1
2      10/23/08 04:45  ((Location unspecified; rural area))  ...   1/10/09       1
3       6/30/13 14:00                           ((Unknown))  ...   8/11/17       1
4       9/28/10 19:30              ((Unspecified location))  ...  11/21/10       1
...               ...                                   ...  ...       ...     ...
16595   8/31/17 21:00                             San Diego  ...    9/5/17     394
16596   8/14/17 14:00                             Las Vegas  ...   8/17/17     473
16597    8/4/17 21:40                              Portland  ...   8/11/17     480
16598   8/15/17 11:00                               Seattle  ...   8/24/17     548
16599    8/4/17 21:15                               Phoenix  ...   8/11/17     558

[16600 rows x 8 columns]

In [30]:
query = '''
  SELECT City, Shape, Reports, State FROM reports_by_city, states
  WHERE Reports >= 10
  AND City != ''
  AND City != 'unknown'
  GROUP BY City
  ORDER BY Reports DESC
'''
city_reports = ps.sqldf(query, locals())

              City      Shape  Reports State
0          Phoenix      Flash      558    AZ
1          Seattle   Changing      548    WA
2         Portland     Circle      480    OR
3        Las Vegas  Rectangle      473    NV
4        San Diego  Rectangle      394    CA
...            ...        ...      ...   ...
1833       Winslow   Changing       10    AZ
1834    Wolf Point      Flash       10    MT
1835     Woodville     Circle       10    TX
1836      Yarmouth   Teardrop       10    MA
1837  Yucca Valley       Disk       10    CA

[1838 rows x 4 columns]

In [33]:
query = '''
  SELECT *, COUNT(Posted) as State_reports FROM eua_df 
  GROUP BY State
'''
state_reports = ps.sqldf(query, locals())

      Date / Time                                City  ...    Posted State_reports
0   7/27/17 05:55                           Anchorage  ...   7/27/17           449
1    8/8/17 20:30                          Huntsville  ...   8/11/17           893
2   8/18/17 11:00                              Conway  ...    9/5/17           761
3    8/4/17 21:15                             Phoenix  ...   8/11/17          3464
4    8/1/17 02:00                       Moreno Valley  ...    8/4/17         11402
5    8/9/17 13:15  Rabbit Ears Pass/Steamboat springs  ...   8/17/17          2106
6    8/5/17 17:00                      Norwalk/Darien  ...   9/12/17          1192
7   8/14/17 17:20                          Selbyville  ...    9/5/17           271
8    8/1/17 01:00                           Bradenton  ...    5/9/19          5577
9    8/1/17 06:15                    Columbus (North)  ...    8/4/17          1802
10   8/7/17 20:49                               Kapaa  ...   8/11/17           450
11   8/7/17 22:03                            Moorland  ...   8/11/17           859
12   8/2/17 23:06                            Lewiston  ...    8/4/17           810
13   8/1/17 14:00                              Joliet  ...   7/25/19          3103
14   8/8/17 10:21                        Ellettsville  ...   8/11/17          1675
15  8/16/17 03:00                         Garden City  ...   8/17/17           796
16   8/4/17 22:00                          Louisville  ...   8/11/17          1079
17   7/4/17 20:30                              Kenner  ...    7/7/17           761
18   8/2/17 22:40                          Fall River  ...    8/4/17          1749
19   8/1/17 21:00                               Joppa  ...    8/4/17          1234
20   8/2/17 00:35                            Franklin  ...    8/4/17           762
21   8/1/17 21:45                              Macomb  ...    8/4/17          2478
22   8/1/17 02:45                            Corcoran  ...    8/4/17          1423
23   8/1/17 21:00                           Wheatland  ...    8/4/17          1881
24  7/10/17 22:00                           Southaven  ...  10/19/17           500
25   8/4/17 23:00                           Kalispell  ...   8/11/17           664
26   8/4/17 21:00                          Greensboro  ...   8/11/17          2512
27   7/5/17 11:24                               Fargo  ...    7/7/17           154
28   8/9/17 22:00                            Mitchell  ...   8/11/17           465
29   8/7/17 09:00                              Nelson  ...   8/11/17           750
30   8/1/17 16:40                          Piscataway  ...    8/4/17          1878
31   8/1/17 23:30                         Silver City  ...   1/14/18          1063
32  8/11/17 16:00                     North Las Vegas  ...   8/17/17          1140
33   8/2/17 22:30                                Troy  ...   8/11/17          3871
34   8/1/17 22:30                            Mayfield  ...    8/4/17          2964
35   8/1/17 21:00                           Newcastle  ...    8/4/17           956
36   8/1/17 21:00                            Estacada  ...    8/4/17          2398
37   8/3/17 22:15                             Altoona  ...    8/4/17          3259
38   8/3/17 21:30                        West Warwick  ...   8/11/17           410
39  8/11/17 22:57                           Fort Mill  ...   8/17/17          1563
40   8/4/17 21:15                              Howard  ...   8/11/17           255
41  8/12/17 17:00                         Old Hickory  ...   8/17/17          1557
42  8/11/17 17:45                             Leander  ...   7/19/18          4154
43   8/3/17 09:00                           Riverdale  ...    8/4/17           978
44   8/5/17 00:00                             Norfolk  ...   8/11/17          1792
45  7/26/17 22:00                          Colchester  ...   7/27/17           418
46   8/2/17 23:35                           Oakesdale  ...    8/4/17          4901
47   8/7/17 05:30                              Waupun  ...   8/11/17          1689
48  8/10/17 05:45                         Martinsburg  ...   8/11/17           614
49  7/13/17 04:00                            Pinedale  ...   7/23/17           258

[50 rows x 8 columns]

Enfatizar a cidade, a quantidade de relatos e formato do objeto nÃ£o identificado

In [35]:
query = '''
  SELECT State, MAX(Reports) as State_reports  FROM per_state
'''
most_reported_state = ps.sqldf(query, locals())

  State  State_reports
0    CA          11402

In [37]:
query = '''
  SELECT city_reports.City, city_reports.Shape, city_reports.Reports 
  FROM city_reports, per_state AS state
  WHERE state.State = city_reports.State
  AND city_reports.Reports > 10
'''
ca_cities = ps.sqldf(query, locals())

                    City      Shape  Reports
0                Phoenix      Flash      558
1                Seattle   Changing      548
2               Portland     Circle      480
3              Las Vegas  Rectangle      473
4              San Diego  Rectangle      394
...                  ...        ...      ...
1654          Winnemucca   Cylinder       11
1655  Wrightsville Beach      Other       11
1656               Xenia      Other       11
1657            Yorktown  Rectangle       11
1658             Zeeland      Light       11

[1659 rows x 3 columns]

In [39]:
query = '''
  SELECT city_reports.City, city_reports.Shape, city_reports.Reports 
  FROM city_reports, most_reported_state AS mr_state
  WHERE mr_state.State = city_reports.State
  AND city_reports.Reports > 10
  AND city_reports.Shape !='Unknown'
  AND city_reports.Shape !=''
  '''
ca_cities = ps.sqldf(query, locals())

                 City      Shape  Reports
0           San Diego  Rectangle      394
1         Los Angeles   Changing      379
2          Sacramento   Changing      242
3            San Jose      Other      223
4       San Francisco    Chevron      200
..                ...        ...      ...
221    Imperial Beach   Fireball       11
222           Miramar  Formation       11
223            Nipomo   Fireball       11
224       Pismo Beach       Disk       11
225  West Los Angeles   Triangle       11

[226 rows x 3 columns]